maksidze/SmartESC_STM32_M365/Core/Src/main.c
  static uint8_t  checkRemote = 0;
  static uint16_t distance;
  static float    steering;
  static int      distanceErr;
  static int      lastDistance = 0;
  static uint16_t transpotter_counter = 0;
#endif

static int16_t    speed;                // local variable for speed. -1000 to 1000
#ifndef VARIANT_TRANSPOTTER
  static int16_t  steer;                // local variable for steering. -1000 to 1000
  static int16_t  steerRateFixdt;       // local fixed-point variable for steering rate limiter
  static int16_t  speedRateFixdt;       // local fixed-point variable for speed rate limiter
  static int32_t  steerFixdt;           // local fixed-point variable for steering low-pass filter
  static int32_t  speedFixdt;           // local fixed-point variable for speed low-pass filter
#endif

static uint32_t    inactivity_timeout_counter;
static MultipleTap MultipleTapBrake;    // define multiple tap functionality for the Brake pedal

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  __HAL_RCC_AFIO_CLK_ENABLE();
  HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4);
  /* System interrupt init*/
  /* MemoryManagement_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(MemoryManagement_IRQn, 0, 0);
  /* BusFault_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(BusFault_IRQn, 0, 0);
  /* UsageFault_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(UsageFault_IRQn, 0, 0);
  /* SVCall_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SVCall_IRQn, 0, 0);
  /* DebugMonitor_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DebugMonitor_IRQn, 0, 0);
  /* PendSV_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(PendSV_IRQn, 0, 0);
  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  __HAL_RCC_DMA1_CLK_DISABLE();

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  MX_TIM1_Init();
  MX_USART3_UART_Init();
  MX_TIM3_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */

  BLDC_Init();        // BLDC Controller Init

  HAL_GPIO_WritePin(OFF_PORT, OFF_PIN, GPIO_PIN_SET);   // Activate Latch
  Input_Lim_Init();   // Input Limitations Init
  Input_Init();       // Input Init

  HAL_ADC_Start(&hadc1);
  HAL_ADC_Start(&hadc2);

  poweronMelody();
  HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_SET);

  int16_t speedL     = 0, speedR     = 0;
  int16_t lastSpeedL = 0, lastSpeedR = 0;

  int32_t board_temp_adcFixdt = adc_buffer.temp << 16;  // Fixed-point filter output initialized with current ADC converted to fixed-point
  int16_t board_temp_adcFilt  = adc_buffer.temp;
  int16_t board_temp_deg_c;

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

	    HAL_Delay(DELAY_IN_MAIN_LOOP);        //delay in ms

	    readCommand();                        // Read Command: cmd1, cmd2
	    calcAvgSpeed();                       // Calculate average measured speed: speedAvg, speedAvgAbs

	    #ifndef VARIANT_TRANSPOTTER
	      // ####### MOTOR ENABLING: Only if the initial input is very small (for SAFETY) #######
	      if (enable == 0 && (!rtY_Left.z_errCode && !rtY_Right.z_errCode) && (cmd1 > -50 && cmd1 < 50) && (cmd2 > -50 && cmd2 < 50)){
	        beepShort(6);                     // make 2 beeps indicating the motor enable
	        beepShort(4); HAL_Delay(100);
	        steerFixdt = speedFixdt = 0;      // reset filters
	        enable = 1;                       // enable motors
	        consoleLog("-- Motors enabled --\r\n");
	      }

	      // ####### VARIANT_HOVERCAR #######
	      #if defined(VARIANT_HOVERCAR) || defined(VARIANT_SKATEBOARD) || defined(ELECTRIC_BRAKE_ENABLE)
	        uint16_t speedBlend;                                        // Calculate speed Blend, a number between [0, 1] in fixdt(0,16,15)
	        speedBlend = (uint16_t)(((CLAMP(speedAvgAbs,10,60) - 10) << 15) / 50); // speedBlend [0,1] is within [10 rpm, 60rpm]
	      #endif

	      #ifdef STANDSTILL_HOLD_ENABLE
	        standstillHold();                                           // Apply Standstill Hold functionality. Only available and makes sense for VOLTAGE or TORQUE Mode
	      #endif

	      #ifdef VARIANT_HOVERCAR
	        if (speedAvgAbs < 60) {                                     // Check if Hovercar is physically close to standstill to enable Double tap detection on Brake pedal for Reverse functionality
	          multipleTapDet(cmd1, HAL_GetTick(), &MultipleTapBrake);   // Brake pedal in this case is "cmd1" variable
	        }

	        if (cmd1 > 30) {                                            // If Brake pedal (cmd1) is pressed, bring to 0 also the Throttle pedal (cmd2) to avoid "Double pedal" driving
	          cmd2 = (int16_t)((cmd2 * speedBlend) >> 15);
	          cruiseControl((uint8_t)rtP_Left.b_cruiseCtrlEna);         // Cruise control deactivated by Brake pedal if it was active
	        }
	      #endif

	      #ifdef ELECTRIC_BRAKE_ENABLE
	        electricBrake(speedBlend, MultipleTapBrake.b_multipleTap);  // Apply Electric Brake. Only available and makes sense for TORQUE Mode
	      #endif

	      #ifdef VARIANT_HOVERCAR
	        if (speedAvg > 0) {                                         // Make sure the Brake pedal is opposite to the direction of motion AND it goes to 0 as we reach standstill (to avoid Reverse driving by Brake pedal)
	          cmd1 = (int16_t)((-cmd1 * speedBlend) >> 15);
	        } else {
	          cmd1 = (int16_t)(( cmd1 * speedBlend) >> 15);
	        }
	      #endif

	      #ifdef VARIANT_SKATEBOARD
	        if (cmd2 < 0) {                                           // When Throttle is negative, it acts as brake. This condition is to make sure it goes to 0 as we reach standstill (to avoid Reverse driving)
	          if (speedAvg > 0) {                                     // Make sure the braking is opposite to the direction of motion
	            cmd2 = (int16_t)(( cmd2 * speedBlend) >> 15);
	          } else {
	            cmd2 = (int16_t)((-cmd2 * speedBlend) >> 15);
	          }
	        }
	      #endif

	      // ####### LOW-PASS FILTER #######
	      rateLimiter16(cmd1, RATE, &steerRateFixdt);
	      rateLimiter16(cmd2, RATE, &speedRateFixdt);
	      filtLowPass32(steerRateFixdt >> 4, FILTER, &steerFixdt);
	      filtLowPass32(speedRateFixdt >> 4, FILTER, &speedFixdt);
	      steer = (int16_t)(steerFixdt >> 16);  // convert fixed-point to integer
	      speed = (int16_t)(speedFixdt >> 16);  // convert fixed-point to integer

	      // ####### VARIANT_HOVERCAR #######
	      #ifdef VARIANT_HOVERCAR
	        if (!MultipleTapBrake.b_multipleTap) {  // Check driving direction
	          speed = steer + speed;                // Forward driving: in this case steer = Brake, speed = Throttle
	        } else {
	          speed = steer - speed;                // Reverse driving: in this case steer = Brake, speed = Throttle
	        }
	      #endif

	      // ####### MIXER #######
	      // speedR = CLAMP((int)(speed * SPEED_COEFFICIENT -  steer * STEER_COEFFICIENT), INPUT_MIN, INPUT_MA);
	      // speedL = CLAMP((int)(speed * SPEED_COEFFICIENT +  steer * STEER_COEFFICIENT), INPUT_MIN, INPUT_MA);
	      mixerFcn(speed << 4, steer << 4, &speedR, &speedL);   // This function implements the equations above

	      // ####### SET OUTPUTS (if the target change is less than +/- 100) #######
	      if ((speedL > lastSpeedL-100 && speedL < lastSpeedL+100) && (speedR > lastSpeedR-100 && speedR < lastSpeedR+100)) {
	        #ifdef INVERT_R_DIRECTION
	          pwmr = speedR;
	        #else
	          pwmr = -speedR;
	        #endif
	        #ifdef INVERT_L_DIRECTION
	          pwml = -speedL;
	        #else
	          pwml = speedL;
	        #endif
	      }
	    #endif

	    #ifdef VARIANT_TRANSPOTTER
	      distance    = CLAMP(cmd1 - 180, 0, 4095);
	      steering    = (cmd2 - 2048) / 2048.0;
	      distanceErr = distance - (int)(setDistance * 1345);

