maksidze/SmartESC_STM32_M365/Core/Src/main.c
	      if (nunchuk_connected == 0) {
	        speedL = speedL * 0.8f + (CLAMP(distanceErr + (steering*((float)MAX(ABS(distanceErr), 50)) * ROT_P), -850, 850) * -0.2f);
	        speedR = speedR * 0.8f + (CLAMP(distanceErr - (steering*((float)MAX(ABS(distanceErr), 50)) * ROT_P), -850, 850) * -0.2f);
	        if ((speedL < lastSpeedL + 50 && speedL > lastSpeedL - 50) && (speedR < lastSpeedR + 50 && speedR > lastSpeedR - 50)) {
	          if (distanceErr > 0) {
	            enable = 1;
	          }
	          if (distanceErr > -300) {
	            #ifdef INVERT_R_DIRECTION
	              pwmr = speedR;
	            #else
	              pwmr = -speedR;
	            #endif
	            #ifdef INVERT_L_DIRECTION
	              pwml = -speedL;
	            #else
	              pwml = speedL;
	            #endif

	            if (checkRemote) {
	              if (!HAL_GPIO_ReadPin(LED_PORT, LED_PIN)) {
	                //enable = 1;
	              } else {
	                enable = 0;
	              }
	            }
	          } else {
	            enable = 0;
	          }
	        }
	        timeoutCnt = 0;
	      }

	      if (timeoutCnt > TIMEOUT) {
	        pwml = 0;
	        pwmr = 0;
	        enable = 0;
	        #ifdef SUPPORT_LCD
	          LCD_SetLocation(&lcd,  0, 0); LCD_WriteString(&lcd, "Len:");
	          LCD_SetLocation(&lcd,  8, 0); LCD_WriteString(&lcd, "m(");
	          LCD_SetLocation(&lcd, 14, 0); LCD_WriteString(&lcd, "m)");
	        #endif
	        HAL_Delay(1000);
	        nunchuk_connected = 0;
	      }

	      if ((distance / 1345.0) - setDistance > 0.5 && (lastDistance / 1345.0) - setDistance > 0.5) { // Error, robot too far away!
	        enable = 0;
	        beepLong(5);
	        #ifdef SUPPORT_LCD
	          LCD_ClearDisplay(&lcd);
	          HAL_Delay(5);
	          LCD_SetLocation(&lcd, 0, 0); LCD_WriteString(&lcd, "Emergency Off!");
	          LCD_SetLocation(&lcd, 0, 1); LCD_WriteString(&lcd, "Keeper too fast.");
	        #endif
	        poweroff();
	      }

	      #ifdef SUPPORT_NUNCHUK
	        if (transpotter_counter % 500 == 0) {
	          if (nunchuk_connected == 0 && enable == 0) {
	            if (Nunchuk_Ping()) {
	              HAL_Delay(500);
	              Nunchuk_Init();
	              #ifdef SUPPORT_LCD
	                LCD_SetLocation(&lcd, 0, 0); LCD_WriteString(&lcd, "Nunchuk Control");
	              #endif
	              timeoutCnt = 0;
	              HAL_Delay(1000);
	              nunchuk_connected = 1;
	            }
	          }
	        }
	      #endif

	      #ifdef SUPPORT_LCD
	        if (transpotter_counter % 100 == 0) {
	          if (LCDerrorFlag == 1 && enable == 0) {

	          } else {
	            if (nunchuk_connected == 0) {
	              LCD_SetLocation(&lcd,  4, 0); LCD_WriteFloat(&lcd,distance/1345.0,2);
	              LCD_SetLocation(&lcd, 10, 0); LCD_WriteFloat(&lcd,setDistance,2);
	            }
	            LCD_SetLocation(&lcd,  4, 1); LCD_WriteFloat(&lcd,batVoltage, 1);
	            // LCD_SetLocation(&lcd, 11, 1); LCD_WriteFloat(&lcd,MAX(ABS(currentR), ABS(currentL)),2);
	          }
	        }
	      #endif
	      transpotter_counter++;
	    #endif

	    // ####### SIDEBOARDS HANDLING #######
	    #if defined(SIDEBOARD_SERIAL_USART2)
	      sideboardLeds(&sideboard_leds_L);
	      sideboardSensors((uint8_t)Sideboard_L.sensors);
	    #endif
	    #if defined(SIDEBOARD_SERIAL_USART3)
	      sideboardLeds(&sideboard_leds_R);
	      sideboardSensors((uint8_t)Sideboard_R.sensors);
	    #endif

	    // ####### CALC BOARD TEMPERATURE #######
	    filtLowPass32(adc_buffer.temp, TEMP_FILT_COEF, &board_temp_adcFixdt);
	    board_temp_adcFilt  = (int16_t)(board_temp_adcFixdt >> 16);  // convert fixed-point to integer
	    board_temp_deg_c    = (TEMP_CAL_HIGH_DEG_C - TEMP_CAL_LOW_DEG_C) * (board_temp_adcFilt - TEMP_CAL_LOW_ADC) / (TEMP_CAL_HIGH_ADC - TEMP_CAL_LOW_ADC) + TEMP_CAL_LOW_DEG_C;

	    // ####### DEBUG SERIAL OUT #######
	    #if defined(DEBUG_SERIAL_USART2) || defined(DEBUG_SERIAL_USART3)
	      if (main_loop_counter % 25 == 0) {    // Send data periodically every 125 ms
	        setScopeChannel(0, (int16_t)input1);                    // 1: INPUT1
	        setScopeChannel(1, (int16_t)input2);                    // 2: INPUT2
	        setScopeChannel(2, (int16_t)speedR);                    // 3: output command: [-1000, 1000]
	        setScopeChannel(3, (int16_t)speedL);                    // 4: output command: [-1000, 1000]
	        setScopeChannel(4, (int16_t)adc_buffer.batt1);          // 5: for battery voltage calibration
	        setScopeChannel(5, (int16_t)(batVoltage * BAT_CALIB_REAL_VOLTAGE / BAT_CALIB_ADC)); // 6: for verifying battery voltage calibration
	        setScopeChannel(6, (int16_t)board_temp_adcFilt);        // 7: for board temperature calibration
	        setScopeChannel(7, (int16_t)board_temp_deg_c);          // 8: for verifying board temperature calibration
	        consoleScope();
	      }
	    #endif

	    // ####### FEEDBACK SERIAL OUT #######
	    #if defined(FEEDBACK_SERIAL_USART2) || defined(FEEDBACK_SERIAL_USART3)
	      if (main_loop_counter % 2 == 0) {    // Send data periodically every 10 ms
	        Feedback.start	        = (uint16_t)SERIAL_START_FRAME;
	        Feedback.cmd1           = (int16_t)cmd1;
	        Feedback.cmd2           = (int16_t)cmd2;
	        Feedback.speedR_meas	  = (int16_t)rtY_Right.n_mot;
	        Feedback.speedL_meas	  = (int16_t)rtY_Left.n_mot;
	        Feedback.batVoltage	    = (int16_t)(batVoltage * BAT_CALIB_REAL_VOLTAGE / BAT_CALIB_ADC);
	        Feedback.boardTemp	    = (int16_t)board_temp_deg_c;

	        #if defined(FEEDBACK_SERIAL_USART2)
	          if(__HAL_DMA_GET_COUNTER(huart2.hdmatx) == 0) {
	            Feedback.cmdLed         = (uint16_t)sideboard_leds_L;
	            Feedback.checksum       = (uint16_t)(Feedback.start ^ Feedback.cmd1 ^ Feedback.cmd2 ^ Feedback.speedR_meas ^ Feedback.speedL_meas
	                                               ^ Feedback.batVoltage ^ Feedback.boardTemp ^ Feedback.cmdLed);

